app/controllers/search_controller.rb

  def live
    @search = params[:word]
    if @search.blank?
      @vocabularies = Vocabulary.paginate :all, :page => params[:page], :order => 'word'
---
SELECT * FROM `vocabularies` WHERE (word LIKE '%ha%') ORDER BY word
SELECT count(*) AS count_all FROM `vocabularies`

  def by_language
    begin
      @language = Vocabulary.find_by_permalink(params[:id])
---
SELECT * FROM `vocabularies` WHERE (`vocabularies`.`permalink` = 'spanish') LIMIT 1

  def by_tag
    begin
      if params[:id] == 'untagged'
        @tag = 'Untagged'
        @vocabularies = Vocabulary.paginate :all, :joins => 'LEFT JOIN taggings ON taggings.taggable_id = vocabularies.id', :group => 'vocabularies.id', :having => 'COUNT(taggings.id) = 0', :page => params[:page], :order => 'word'
      else
        @tag = Tag.find_by_permalink(params[:id])
---
SELECT `vocabularies`.* FROM `vocabularies` LEFT JOIN taggings ON taggings.taggable_id = vocabularies.id
SELECT count(*) AS count_all FROM `vocabularies`
SELECT tags.id, tags.name, tags.permalink, COUNT(*) AS count FROM `tags` INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN vocabularies ON vocabularies.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Vocabulary') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
SELECT * FROM `tags` WHERE (`tags`.`permalink` = 'language') LIMIT 1

  def by_type
    begin
      conditions = params[:id] == "other" ? "type IS NULL" : "type = '#{params[:id]}'"
      @vocabularies = Vocabulary.paginate :all, :conditions => conditions, :page => params[:page], :order => 'word'
---
SELECT * FROM `vocabularies` WHERE (type = 'Language') ORDER BY word
SELECT count(*) AS count_all FROM `vocabularies`