app/controllers/status_controller.rb

SELECT * FROM `wiki_pages` WHERE (created_at >= '2010-10-08 11:46:38') ORDER BY created_at DESC
---
  def index
    @timeline = params.key?(:since) ? Status.timeline(params[:user_id], Time.at(params[:since].to_f)) : Status.timeline(params[:user_id])
    @page = params.key?(:last) ? params[:last].to_i + 1 : (params.key?(:page) ? params[:page] : 1)
    @timeline_results = @timeline.paginate :page => @page, :per_page => 15