app/controllers/vocabularies_controller.rb

  def index
    @vocabularies_list = params[:language] ? Vocabulary.find(:all, :order => 'word', :conditions => ['language_id != ?',params[:language]]) : Vocabulary.find(:all, :order => 'word')
    @vocabularies = @vocabularies_list.paginate :page => params[:page], :per_page => 150
    respond_to do |format|
      format.html { render :action => 'index' }
      format.js {
        render :update do |page|
          if params[:menu]
            page.hide 'browser'
            page << "['live_search','by_language','by_tag','by_type'].collect(function(v) { $(v + '_link').className = 'tab_link'; })"
            page << "$('#{params[:menu]}_link').addClassName('active')"
            page.replace_html 'browser', render(:partial => params[:menu])
            page << "new Effect.BlindDown('browser')"
          else
            page << "var vocabularies = new Array('" + @vocabularies_list.collect { |v| v.word }.join("','") + "');"
---
SELECT * FROM `vocabularies` WHERE ( (`vocabularies`.`type` = 'Language' ) ) ORDER BY word
SELECT * FROM `vocabularies` ORDER BY word
SELECT count(*) AS count_all FROM `vocabularies`
SELECT `vocabularies`.* FROM `vocabularies` LEFT JOIN taggings ON taggings.taggable_id = vocabularies.id